[{"_path":"/blog/role-of-modeling-simulation-biopharmaceutical-development","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"The Role of Modeling and Simulation in Biopharmaceutical Development","description":"In the rapidly evolving world of drug development, advancements in technology have paved the way for innovations that significantly boost efficiency and efficacy. Among these, modeling and simulation have emerged as transformative tools. Through virtual experiments and data-driven predictions, companies like Certara have demonstrated how these technologies streamline drug development, enhance decision-making, and anticipate risks and benefits across a spectrum of therapeutic areas.","_type":"markdown","_id":"content:blog:role-of-modeling-simulation-biopharmaceutical-development.md","_source":"content","_file":"blog/role-of-modeling-simulation-biopharmaceutical-development.md","_stem":"blog/role-of-modeling-simulation-biopharmaceutical-development","_extension":"md","sitemap":{"loc":"/blog/role-of-modeling-simulation-biopharmaceutical-development"}},{"_path":"/blog/top_5_features_ctms_site_management_monitoring","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"Top 5 Features to Look for in a CTMS for Site Management and Monitoring","description":"In the competitive landscape of clinical trial management systems (CTMS), ensuring comprehensive site management and monitoring capabilities is crucial for successful trial outcomes. Many companies offer CTMS solutions with varying capabilities, making it essential for stakeholders to identify key features that guarantee effective site oversight. This article outlines the top five features to look for when selecting a CTMS and provides insights into some prominent CTMS providers in the industry.","_type":"markdown","_id":"content:blog:top_5_features_ctms_site_management_monitoring.md","_source":"content","_file":"blog/top_5_features_ctms_site_management_monitoring.md","_stem":"blog/top_5_features_ctms_site_management_monitoring","_extension":"md","sitemap":{"loc":"/blog/top_5_features_ctms_site_management_monitoring"}}]